print("Это счетчик до 30. Напишите *выход* что бы выйти.")
count = 0
while True:
    question = input("Напишите что нибудь:").lower()
    count += 1
    if count == 1:
        print("Вы написали 1 сообщение")
    if count == 2:
        print("Вы написали 2 сообщения")
    if count == 3:
        print("Вы написали 3 сообщения")
    if count == 4:
        print("Вы написали 4 сообщения")
    if count == 5:
        print("Вы написали 5 сообщений")
    if count == 6:
        print("Вы написали 6 сообщений")
    if count == 7:
        print("Вы написали 7 сообщений")
    if count == 8:
        print("Вы написали 8 сообщений")
    if count == 9:
        print("Вы написали 9 сообщений")
    if count == 10:
        print("Вы написали 10 сообщений")
    if count == 11:
        print("Вы написали 11 сообщений")
    if count == 12:
        print("Вы написали 12 сообщений")
    if count == 13:
        print("Вы написали 13 сообщений")
    if count == 14:
        print("Вы написали 14 сообщений")
    if count == 15:
        print("Вы написали 15 сообщений")
    if count == 16:
        print("Вы написали 16 сообщений")
    if count == 17:
        print("Вы написали 17 сообщений")
    if count == 18:
        print("Вы написали 18 сообщений")
    if count == 19:
        print("Вы написали 19 сообщений")
    if count == 20:
        print("Вы написали 20 сообщений")
    if count == 21:
        print("Вы написали 21 сообщений")
    if count == 22:
        print("Вы написали 22 сообщений")
    if count == 23:
        print("Вы написали 23 сообщений")
    if count == 24:
        print("Вы написали 24 сообщений")
    if count == 25:
        print("Вы написали 25 сообщений")
    if count == 26:
        print("Вы написали 26 сообщений")
    if count == 27:
        print("Вы написали 27 сообщений")
    if count == 28:
        print("Вы написали 28 сообщений")
    if count == 29:
        print("Вы написали 29 сообщений")
    if count == 30:
        print("Вы написали 30 сообщений. Счетчик переполнен!")
    elif ("выход") in question:
        print(".")
        break