print("====================================================Попробуй взломать меня:)========================================================= ")
while True:
    print("========================================================")
                                                                                                                         
    name = input("Введите свое имя (полное):")        
                                                                                                            
    print("=========================================================")

    if name.lower() == "мухаммадамин":
        print("Правильно!")
        break
    else:
        print("Это не мое имя:) Подсказка: Мое короткое имя + амин")

while True:
    print("========================================================")
                                                                                                                         
    city = input("Введите ваш город:")        
                                                                                                            
    print("=========================================================")                                                

    if city.lower() == "тюмень":
        print("Правильно!!!") 
        break
    else:
        print("Я не живу здесь;) Подсказка: Это столица сибири")

while True:
    print("========================================================")
                                                                                                                         
    birthday = input("Введите свое полное ДР(без укорачивания и т.п):")        
                                                                                                            
    print("=========================================================")

    if birthday.lower() == "1 февраля 2015 года":
        print("Правильно! Ты че сталкер? :)")
        break
    else:
        print("Это не мое др. Подсказка: Мне 11 лет в 2026 и родился в самом коротком месяце в году")

while True:
    print("========================================================")
                                                                                                                         
    nik = input("Введите ваш ник:")        
                                                                                                            
    print("=========================================================")
    if nik == "MYXA7777777":
        print("Даааа! Верно!")
        break
    else:
        print("Неправильно. Подсказка: MYXA + 7 раз моя любимая цифра") 

while True:
    print("========================================================")
                                                                                                                         
    password = input("Введите ваш пароль:")        
                                                                                                            
    print("=========================================================")
    if password == "myxasalimov01021":
        print("КАК ТЫ ЭТО СДЕЛАЛ!?!?")
        break 
    else:
        print("Неправильно. Подсказка: мое прозвище фамилия и ребус:) = 7 * 0 = ?    7:7 = ?    1000000*0 = ?   25001152: 12500576 = ?  123456789:123456789 = ?")

while True:
    print("========================================================")
                                                                                                                         
    login = input("Введите вашу полную эл. почту:")        
                                                                                                            
    print("=========================================================")
    if login == "myxaai7777777@gmail.com":
         print("Да Ты хакер!!! ")
         break
    else: 
        print("неправильно:) подсказка: Мой любимый ии и ответ из этого деления : 1555554 : 2 = ?") 

while True:
    print("========================================================")
                                                                                                                         
    game = input("Введите вашу любимую игру:")        
                                                                                                            
    print("=========================================================")
    if game.lower() == "assasins creed":
        print("Да откуда ты это вообще знаешь!?!?!?!?!?")
        break
    else:
        print("Неверно!!! Подсказка  : в этой игре много исторических личностей в том числе Леонардо да винчи и игра от ubisoft")


while True:
    print("========================================================")
                                                                                                                         
    sport = input("Введите ваш любимый спорт:")        
                                                                                                            
    print("=========================================================")
    if sport.lower() == "единоборства + футбол":
        print("ВЕЕЕРНООО!!!!!!!!!!!!")
        break
    else:
        print("Неправильно!!!!!!!!! Подсказка: единое название спортам в которых можно и бороть и бить + самый популярный спорт в бразилии")

while True:
    print("========================================================")
                                                                                                                         
    sister = input("Введите полное имя вашей сестры:")        
                                                                                                            
    print("=========================================================")
    if sister.lower() == "сановбар":
        print(" ДААА!!!")
        break
    else:
        print("НЕВЕРНООО!!! Подсказка : Са_____р")

while True:
    print("========================================================")
                                                                                                                         
    sisterdr = input("Введите полное др вашей сестры:")        
                                                                                                            
    print("=========================================================")
    if sisterdr.lower() == "27 июля 2017 года":
        print("ДОСТУП РАЗРЕШЕН!!! Копируй ссылку и переходи : https://rutube.ru/video/e9813ac082c6b5c4866f734cc7684d08/ Напиши *Выход* Что бы выйти")
    elif "выход".lower() in question:
        print("s")
        break
    else:
        print("НЕВЕРНОО!!! Подсказка - ей в 2к26 8 л. и родилась в месяце который начинается на букву И")
           


        




                                                     